Revit 2024 API
RoutingConditions.AppendCondition Method
 Appends a routing condition to the end of existing routing conditions. Note that the first item (indexed at 0) is the condition for the primary connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void AppendCondition(
	RoutingCondition condition
)
Visual Basic
Public Sub AppendCondition ( _
	condition As RoutingCondition _
)
Visual C++
public:
void AppendCondition(
	RoutingCondition^ condition
)
Parameters
condition
Type: Autodesk.Revit.DB.RoutingCondition
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Mechanical Electrical Piping.
See Also
RoutingConditions Class
Autodesk.Revit.DB Namespace